# : 한 줄 주석
"""
    : 여러 줄 주석
"""
'''
    : 여러 줄 주석
'''

"""
    변수 설정
        - 앞에 데이터형은 사용하지 않음
            예) a=10
                b=10.5
                c=""
                d=True
        - 형변환
            boolean(1)=true
        - 문자열 결합
            ""+str(10)
        - 연산자 => 형변환
            정수 : int()
            실수 : float()
            문자열 : str()
            and : &&
            or : ||
            not : !
        - 제어문
            들여쓰기 매우 중요
                1) 조건문
                    if 조건문 : => if(조건문):, if 조건문 :
                        실행 문장
                =========================> 단일 조건문
                    if 조건문 :
                        실행 문장
                    else : 
                        실행 문장
                =========================> 선택 조건문
                    if 조건문 : 
                        실행 문장
                    elif 조건문 :
                        실행 문장
                    elif 조건문 :
                        실행 문장
                    else 조건문
                =========================> 다중 조건문
                2) 반복문
                3) 반복제어문

"""